[
  {
    "title": "How Strength Training Protects Your Heart as You Age",
    "description": "Discover how building muscle through resistance training supports circulation and heart resilience.",
    "primaryKeyword": "strength training benefits for heart health over 50",
    "topicCluster": "heart-health",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:41.504Z"
  },
  {
    "title": "How Fiber-Rich Diets Support Heart Health in People Over 60",
    "description": "Learn how increasing dietary fiber can improve cholesterol and reduce cardiovascular events.",
    "primaryKeyword": "high fiber diet benefits for heart health over 60",
    "topicCluster": "heart-health",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:47.269Z"
  },
  {
    "title": "The Impact of Hot Showers on Blood Pressure and Heart Rate",
    "description": "Find out how hot water affects circulation and whether it poses risks for those with heart concerns.",
    "primaryKeyword": "hot showers and blood pressure effects elderly",
    "topicCluster": "heart-health",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:47.815Z"
  },
  {
    "title": "Could Leg Swelling Be a Sign of Heart Trouble After 50?",
    "description": "Recognize how edema in the legs may indicate poor heart pumping and require medical attention.",
    "primaryKeyword": "leg swelling and heart failure symptoms after 50",
    "topicCluster": "cardiovascular-risk",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:48.349Z"
  },
  {
    "title": "The Benefits of Eating Nuts Daily for Heart Protection Over 50",
    "description": "Discover how a handful of nuts each day can reduce bad cholesterol and support artery health.",
    "primaryKeyword": "daily nut consumption and heart protection after 50",
    "topicCluster": "heart-health",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:49.428Z"
  },
  {
    "title": "Why Women’s Heart Attack Symptoms Differ After Menopause",
    "description": "Learn about the unique signs women experience and why they’re often missed or misdiagnosed.",
    "primaryKeyword": "women heart attack symptoms after menopause",
    "topicCluster": "cardiovascular-risk",
    "coreKeyword": "heart health",
    "createdAt": "2025-11-26T21:27:51.013Z"
  }
]